import { StyleSheet, Text, View, ScrollView } from 'react-native';
import React from 'react';

export default function Policy() {
  return (
    <ScrollView style={styles.container}>
      <Text style={styles.policyText}>
        <Text style={styles.bold}>1. การใช้งานที่เหมาะสม</Text>
        {'\n'}    ผู้ใช้จะต้องใช้ Hahai Application ในการแจ้งพบและติดตามสิ่งของสูญหายเท่านั้น ห้ามใช้แอปในทางที่ผิดกฎหมาย หรือทำให้เกิดความเสียหายแก่บุคคลอื่นหรือสังคม
        {'\n\n'}
        <Text style={styles.bold}>2. ห้ามใช้ภาพที่มีเนื้อหาล่อแหลม</Text>
        {'\n'}    การโพสต์ภาพที่มีเนื้อหาล่อแหลมหรือไม่เหมาะสม เช่น ภาพที่เกี่ยวข้องกับการละเมิดสิทธิ์ของผู้อื่น ภาพอนาจาร ภาพที่มีเนื้อหาทางเพศ หรือภาพที่มีการใช้ความรุนแรง จะถูกห้ามโดยเด็ดขาด หากตรวจพบภาพเหล่านี้ ทางแอปจะทำการดำเนินการตามมาตรการที่เหมาะสมทันที
        {'\n\n'}
        <Text style={styles.bold}>3. การตรวจสอบและการระงับบัญชีผู้ใช้</Text>
        {'\n'}    หากพบว่าผู้ใช้ละเมิดกฎข้อ 2 (ห้ามใช้ภาพที่มีเนื้อหาล่อแหลม) หรือทำการกระทำที่ไม่เหมาะสม ทางแอปขอสงวนสิทธิ์ในการตรวจสอบเนื้อหาที่ถูกโพสต์และทำการระงับบัญชีผู้ใช้ที่ละเมิดกฎ โดยไม่ต้องแจ้งให้ทราบล่วงหน้า
        {'\n\n'}
        <Text style={styles.bold}>4. ความรับผิดชอบของผู้ใช้</Text>
        {'\n'}    ผู้ใช้ทุกท่านรับผิดชอบในการโพสต์ข้อมูลและภาพที่ถูกต้องตามข้อกำหนดของแอป รวมถึงข้อมูลส่วนบุคคลของผู้อื่น หากมีการละเมิดสิทธิ์หรือกฎหมายเกี่ยวกับการใช้งานแอป ผู้ใช้จะต้องรับผิดชอบแต่เพียงผู้เดียว
        {'\n\n'}
        <Text style={styles.bold}>5. การบังคับใช้กฎ</Text>
        {'\n'}    Hahai Application จะทำการตรวจสอบเนื้อหาภาพและข้อความที่โพสต์ภายในแอป และหากพบว่ามีการฝ่าฝืนข้อกำหนดใด ๆ ทางทีมงานจะดำเนินการระงับบัญชีผู้ใช้ที่เกี่ยวข้องตามที่เห็นสมควร
        {'\n\n'}
        <Text style={styles.bold}>6. การอัปเดตกฎการใช้งาน</Text>
        {'\n'}    ทางแอปขอสงวนสิทธิ์ในการอัปเดตหรือปรับเปลี่ยนกฎการใช้งานโดยไม่ต้องแจ้งให้ทราบล่วงหน้า ผู้ใช้ควรติดตามการเปลี่ยนแปลงกฎเหล่านี้เพื่อให้แน่ใจว่าใช้งานแอปได้อย่างถูกต้องและปลอดภัย
        {'\n\n'}
        <Text style={styles.bold}>7. การสนับสนุนและติดต่อ</Text>
        {'\n'}    หากมีคำถามหรือข้อสงสัยเกี่ยวกับกฎการใช้งานหรือการกระทำที่ละเมิดกฎกรุณาติดต่อทีมงานผ่านช่องทางที่กำหนดไว้ในแอป
        {'\n'}
      </Text>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    flex: 1,
    padding: 20,
    backgroundColor: '#fff',
  },
  policyText: {
    fontSize: 15,
    lineHeight: 27,
    color: '#333',
    fontFamily: 'Inter',
  },
  bold: {
    fontWeight: '700',
    fontSize: 18, // ขนาดใหญ่ขึ้น
    color: '#006FFD',
  },
});